NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG24/EFR32BG24A010F1024IM48.svd
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFF7</resetMask>
          <fields>
            <field>
              <name>PRECNTOF</name>
              <description>PRECNTOF Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASECNTOF</name>
              <description>BASECNTOF Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAPCNTOF</name>
              <description>WRAPCNTOF Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0</name>
              <description>TOUT0 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT1</name>
              <description>TOUT1 Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0MATCH</name>
              <description>TOUT0MATCH Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT1MATCH</name>
              <description>TOUT1MATCH Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC0</name>
              <description>CC0 Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1</name>
              <description>CC1 Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2</name>
              <description>CC2 Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3</name>
              <description>CC3 Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4</name>
              <description>CC4 Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC5</name>
              <description>CC5 Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC6</name>
              <description>CC6 Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC7</name>
              <description>CC7 Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF0</name>
              <description>COF0 Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF1</name>
              <description>COF1 Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF2</name>
              <description>COF2 Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF3</name>
              <description>COF3 Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF4</name>
              <description>COF4 Interrupt Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF5</name>
              <description>COF5 Interrupt Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF6</name>
              <description>COF6 Interrupt Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COF7</name>
              <description>COF7 Interrupt Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTSUCCESS</name>
              <description>LBTSUCCESS Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTFAILURE</name>
              <description>LBTFAILURE Interrupt Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTPAUSED</name>
              <description>LBTPAUSED Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBTRETRY</name>
              <description>LBTRETRY Interrupt Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCSYNCHED</name>
              <description>RTCCSYNCHED Interrupt Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0MATCHLBT</name>
              <description>TOUT0MATCHLBT Interrupt Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F1F1F1F</resetMask>
          <fields>
            <field>
              <name>RXSETEVENT1</name>
              <description>First event that sets RX req signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Request is never set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Does not wait for any particular event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre counter overflow</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0UF</name>
                  <description>Timeout counter 0 underflow</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1UF</name>
                  <description>Timeout counter 1 underflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCH</name>
                  <description>Timeout counter 0 match</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1MATCH</name>
                  <description>Timeout counter 1 match</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Channel 0 Capture/Compare event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Channel 1 Capture/Compare event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Channel 2 Capture/Compare event</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Channel 3 Capture/Compare event</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC4</name>
                  <description>Channel 4 Capture/Compare event</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDONE</name>
                  <description>MOD indicated that TX completed</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDONE</name>
                  <description>FRC indicated that RX completed</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXORRXDONE</name>
                  <description>MOD/FRC indicated that TX or RX completed</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0</name>
                  <description>DEMOD indicated that syncword 0 was detected</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET1</name>
                  <description>DEMOD indicated that syncword 1 was detected</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0OR1</name>
                  <description>DEMOD indicated that syncword 0 or 1 was detected</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTSUCCESS</name>
                  <description>LBT completed successfully</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTRETRY</name>
                  <description>LBT detected occupied channel and will try again</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTFAILURE</name>
                  <description>LBT could not start transmission</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANYLBT</name>
                  <description>Any LBT event</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCAACK</name>
                  <description>A CCA measurement completed</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA</name>
                  <description>A CCA measurement completed, and channel was clear</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTCCA</name>
                  <description>A CCA measurement completed, and channel was busy</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCHLBT</name>
                  <description>Timeout counter 0 match occurred during LBT operation</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXSETEVENT2</name>
              <description>Second event that sets RX req signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCLREVENT1</name>
              <description>First event that clears RX req signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCLREVENT2</name>
              <description>Second event that clears RX req signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001F1F</resetMask>
          <fields>
            <field>
              <name>TXSETEVENT1</name>
              <description>First event that sets TX req signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Request is never set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Does not wait for any particular event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre counter overflow</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0UF</name>
                  <description>Timeout counter 0 underflow</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1UF</name>
                  <description>Timeout counter 1 underflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCH</name>
                  <description>Timeout counter 0 match</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1MATCH</name>
                  <description>Timeout counter 1 match</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Channel 0 Capture/Compare event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Channel 1 Capture/Compare event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Channel 2 Capture/Compare event</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Channel 3 Capture/Compare event</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC4</name>
                  <description>Channel 4 Capture/Compare event</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDONE</name>
                  <description>MOD indicated that TX completed</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDONE</name>
                  <description>FRC indicated that RX completed</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXORRXDONE</name>
                  <description>MOD/FRC indicated that TX or RX completed</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0</name>
                  <description>DEMOD indicated that syncword 0 was detected</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET1</name>
                  <description>DEMOD indicated that syncword 1 was detected</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0OR1</name>
                  <description>DEMOD indicated that syncword 0 or 1 was detected</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTSUCCESS</name>
                  <description>LBT completed successfully</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTRETRY</name>
                  <description>LBT detected occupied channel and will try again</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTFAILURE</name>
                  <description>LBT could not start transmission</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANYLBT</name>
                  <description>Any LBT event</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCAACK</name>
                  <description>A CCA measurement completed</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA</name>
                  <description>A CCA measurement completed, and channel was clear</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTCCA</name>
                  <description>A CCA measurement completed, and channel was busy</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCHLBT</name>
                  <description>Timeout counter 0 match occurred during LBT operation</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSETEVENT2</name>
              <description>Second event that sets TX req signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
